In [2]:
data2=pd.read_csv(r'C:\Python\Mydata2.csv')

NameError: name 'pd' is not defined

In [3]:
import pandas as pd

In [4]:
data2=pd.read_csv(r'C:\Python\Mydata2.csv')

In [5]:
data2

   Roll No.  Name   Batch
0         1  Pinky     30
1         2   John     32
2         3   Neha     22
3         4    Raj     25

In [6]:
data3=pd.read_csv(r'C:\Python\Mydata3.tsv',sep='\t')

In [7]:
data3

   RollNo   Name  Batch
0    1001  Pinky   1840
1    1002   John   1765
2    1003   Neha   1345
3    1004    Raj   1540

In [9]:
data1=pd.read_excel('C:\Python\Mydata1.xlsx')

In [10]:
data1

   Name   Age  Salary
0  Pinky   30   20000
1   John   32   25000
2   Neha   22   20000
3    Raj   25   20000

In [11]:
import os

In [12]:
os.getcwd()

'C:\\Users\\mayuk'

In [13]:
import pandas as pd

In [14]:
data4=pd.read_excel(r'Mydata1.xlsx')

In [15]:
data4

   Name   Age  Salary
0  Pinky   30   20000
1   John   32   25000
2   Neha   22   20000
3    Raj   25   20000